Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128DA206.h
extern volatile G1W2ADRLBITS G1W2ADRLbits __attribute__((__sfr__));

#define G1W2ADRH G1W2ADRH
extern volatile unsigned int  G1W2ADRH __attribute__((__sfr__));
typedef struct tagG1W2ADRHBITS {
  unsigned W2ADR16:1;
  unsigned W2ADR17:1;
  unsigned W2ADR18:1;
  unsigned W2ADR19:1;
  unsigned W2ADR20:1;
  unsigned W2ADR21:1;
  unsigned W2ADR22:1;
  unsigned W2ADR23:1;
} G1W2ADRHBITS;
extern volatile G1W2ADRHBITS G1W2ADRHbits __attribute__((__sfr__));

#define G1PUW G1PUW
extern volatile unsigned int  G1PUW __attribute__((__sfr__));
__extension__ typedef struct tagG1PUWBITS {
  union {
    struct {
      unsigned PUW:11;
    };
    struct {
      unsigned PUW0:1;
      unsigned PUW1:1;
      unsigned PUW2:1;
      unsigned PUW3:1;
      unsigned PUW4:1;
      unsigned PUW5:1;
      unsigned PUW6:1;
      unsigned PUW7:1;
      unsigned PUW8:1;
      unsigned PUW9:1;
      unsigned PUW10:1;
    };
  };
} G1PUWBITS;
extern volatile G1PUWBITS G1PUWbits __attribute__((__sfr__));

#define G1PUH G1PUH
extern volatile unsigned int  G1PUH __attribute__((__sfr__));
__extension__ typedef struct tagG1PUHBITS {
  union {
    struct {
      unsigned PUH:11;
    };
    struct {
      unsigned PUH0:1;
      unsigned PUH1:1;
      unsigned PUH2:1;
      unsigned PUH3:1;
      unsigned PUH4:1;
      unsigned PUH5:1;
      unsigned PUH6:1;
      unsigned PUH7:1;
      unsigned PUH8:1;
      unsigned PUH9:1;
      unsigned PUH10:1;
    };
  };
} G1PUHBITS;
extern volatile G1PUHBITS G1PUHbits __attribute__((__sfr__));

#define G1DPADRL G1DPADRL
extern volatile unsigned int  G1DPADRL __attribute__((__sfr__));
typedef struct tagG1DPADRLBITS {
  unsigned DPADR0:1;
  unsigned DPADR1:1;
  unsigned DPADR2:1;
  unsigned DPADR3:1;
  unsigned DPADR4:1;
  unsigned DPADR5:1;
  unsigned DPADR6:1;
  unsigned DPADR7:1;
  unsigned DPADR8:1;
  unsigned DPADR9:1;
  unsigned DPADR10:1;
  unsigned DPADR11:1;
  unsigned DPADR12:1;
  unsigned DPADR13:1;
  unsigned DPADR14:1;
  unsigned DPADR15:1;
} G1DPADRLBITS;
extern volatile G1DPADRLBITS G1DPADRLbits __attribute__((__sfr__));

#define G1DPADRH G1DPADRH
extern volatile unsigned int  G1DPADRH __attribute__((__sfr__));
typedef struct tagG1DPADRHBITS {
  unsigned DPADR16:1;
  unsigned DPADR17:1;
  unsigned DPADR18:1;
  unsigned DPADR19:1;
  unsigned DPADR20:1;
  unsigned DPADR21:1;
  unsigned DPADR22:1;
  unsigned DPADR23:1;
} G1DPADRHBITS;
extern volatile G1DPADRHBITS G1DPADRHbits __attribute__((__sfr__));

#define G1DPW G1DPW
extern volatile unsigned int  G1DPW __attribute__((__sfr__));
__extension__ typedef struct tagG1DPWBITS {
  union {
    struct {
      unsigned DPW:11;
    };
    struct {
      unsigned DPW0:1;
      unsigned DPW1:1;
      unsigned DPW2:1;
      unsigned DPW3:1;
      unsigned DPW4:1;
      unsigned DPW5:1;
      unsigned DPW6:1;
      unsigned DPW7:1;
      unsigned DPW8:1;
      unsigned DPW9:1;
      unsigned DPW10:1;
    };
  };
} G1DPWBITS;
extern volatile G1DPWBITS G1DPWbits __attribute__((__sfr__));

#define G1DPH G1DPH
extern volatile unsigned int  G1DPH __attribute__((__sfr__));
__extension__ typedef struct tagG1DPHBITS {
  union {
    struct {
      unsigned DPH:11;
    };
    struct {
      unsigned DPH0:1;
      unsigned DPH1:1;
      unsigned DPH2:1;
      unsigned DPH3:1;
      unsigned DPH4:1;
      unsigned DPH5:1;
      unsigned DPH6:1;
      unsigned DPH7:1;
      unsigned DPH8:1;
      unsigned DPH9:1;
      unsigned DPH10:1;
    };
  };
} G1DPHBITS;
extern volatile G1DPHBITS G1DPHbits __attribute__((__sfr__));

#define G1DPWT G1DPWT
extern volatile unsigned int  G1DPWT __attribute__((__sfr__));
__extension__ typedef struct tagG1DPWTBITS {
  union {
    struct {
      unsigned DPWT:11;
    };
    struct {
      unsigned DPWT0:1;
      unsigned DPWT1:1;
      unsigned DPWT2:1;
      unsigned DPWT3:1;
      unsigned DPWT4:1;
      unsigned DPWT5:1;
      unsigned DPWT6:1;
      unsigned DPWT7:1;
      unsigned DPWT8:1;
      unsigned DPWT9:1;
      unsigned DPWT10:1;
    };
  };
} G1DPWTBITS;
extern volatile G1DPWTBITS G1DPWTbits __attribute__((__sfr__));

#define G1DPHT G1DPHT
extern volatile unsigned int  G1DPHT __attribute__((__sfr__));
__extension__ typedef struct tagG1DPHTBITS {
  union {
    struct {
      unsigned DPHT:11;
    };
    struct {
      unsigned DPHT0:1;
      unsigned DPHT1:1;
      unsigned DPHT2:1;
      unsigned DPHT3:1;
      unsigned DPHT4:1;
      unsigned DPHT5:1;
      unsigned DPHT6:1;
      unsigned DPHT7:1;
      unsigned DPHT8:1;
      unsigned DPHT9:1;
      unsigned DPHT10:1;
    };
  };
} G1DPHTBITS;
extern volatile G1DPHTBITS G1DPHTbits __attribute__((__sfr__));

#define G1CON2 G1CON2
extern volatile unsigned int  G1CON2 __attribute__((__sfr__));
__extension__ typedef struct tagG1CON2BITS {
  union {
    struct {
      unsigned DPMODE:3;
      unsigned :2;
      unsigned DPBPP:3;
      unsigned DPTEST:2;
      unsigned :2;
      unsigned DPSTGER:2;
      unsigned DPGWDTH:2;
    };
    struct {
      unsigned DPMODE0:1;
      unsigned DPMODE1:1;
      unsigned DPMODE2:1;
      unsigned :2;
      unsigned DPBPP0:1;
      unsigned DPBPP1:1;
      unsigned DPBPP2:1;
      unsigned DPTEST0:1;
      unsigned DPTEST1:1;
      unsigned :2;
      unsigned DPSTGER0:1;
      unsigned DPSTGER1:1;
      unsigned DPGWDTH0:1;
      unsigned DPGWDTH1:1;
    };
  };
} G1CON2BITS;
extern volatile G1CON2BITS G1CON2bits __attribute__((__sfr__));

#define G1CON3 G1CON3
extern volatile unsigned int  G1CON3 __attribute__((__sfr__));
typedef struct tagG1CON3BITS {
  unsigned DPHSOE:1;
  unsigned DPVSOE:1;
  unsigned DPENOE:1;
  unsigned DPPWROE:1;
  unsigned DPHSPOL:1;
  unsigned DPVSPOL:1;
  unsigned DPENPOL:1;
  unsigned DPCLKPOL:1;
  unsigned DPPOWER:1;
  unsigned DPPINOE:1;
} G1CON3BITS;
extern volatile G1CON3BITS G1CON3bits __attribute__((__sfr__));

#define G1ACTDA G1ACTDA
extern volatile unsigned int  G1ACTDA __attribute__((__sfr__));
__extension__ typedef struct tagG1ACTDABITS {
  union {
    struct {
      unsigned ACTPIX:8;
      unsigned ACTLINE:8;
    };
    struct {
      unsigned ACTPIX0:1;
      unsigned ACTPIX1:1;
      unsigned ACTPIX2:1;
      unsigned ACTPIX3:1;
      unsigned ACTPIX4:1;
      unsigned ACTPIX5:1;
      unsigned ACTPIX6:1;
      unsigned ACTPIX7:1;
      unsigned ACTLINE0:1;
      unsigned ACTLINE1:1;
      unsigned ACTLINE2:1;
      unsigned ACTLINE3:1;
      unsigned ACTLINE4:1;
      unsigned ACTLINE5:1;
      unsigned ACTLINE6:1;
      unsigned ACTLINE7:1;
    };
  };
} G1ACTDABITS;
extern volatile G1ACTDABITS G1ACTDAbits __attribute__((__sfr__));

#define G1HSYNC G1HSYNC
extern volatile unsigned int  G1HSYNC __attribute__((__sfr__));
__extension__ typedef struct tagG1HSYNCBITS {
  union {
    struct {
      unsigned HSST:8;
      unsigned HSLEN:8;
    };
    struct {
      unsigned HSST0:1;
      unsigned HSST1:1;
      unsigned HSST2:1;
      unsigned HSST3:1;
      unsigned HSST4:1;
      unsigned HSST5:1;
      unsigned HSST6:1;
      unsigned HSST7:1;
      unsigned HSLEN0:1;
      unsigned HSLEN1:1;
      unsigned HSLEN2:1;
      unsigned HSLEN3:1;
      unsigned HSLEN4:1;
      unsigned HSLEN5:1;
      unsigned HSLEN6:1;
      unsigned HSLEN7:1;
    };
  };
} G1HSYNCBITS;
