Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128DA206.h
#define _U1PWMCON_PWMEN_POSITION                 0x0000000F
#define _U1PWMCON_PWMEN_MASK                     0x00008000
#define _U1PWMCON_PWMEN_LENGTH                   0x00000001

#define _ANCFG_VBGEN_POSITION                    0x00000000
#define _ANCFG_VBGEN_MASK                        0x00000001
#define _ANCFG_VBGEN_LENGTH                      0x00000001

#define _ANCFG_VBG2EN_POSITION                   0x00000001
#define _ANCFG_VBG2EN_MASK                       0x00000002
#define _ANCFG_VBG2EN_LENGTH                     0x00000001

#define _ANCFG_VBG6EN_POSITION                   0x00000002
#define _ANCFG_VBG6EN_MASK                       0x00000004
#define _ANCFG_VBG6EN_LENGTH                     0x00000001

#define _ANSB_ANSB0_POSITION                     0x00000000
#define _ANSB_ANSB0_MASK                         0x00000001
#define _ANSB_ANSB0_LENGTH                       0x00000001

#define _ANSB_ANSB1_POSITION                     0x00000001
#define _ANSB_ANSB1_MASK                         0x00000002
#define _ANSB_ANSB1_LENGTH                       0x00000001

#define _ANSB_ANSB2_POSITION                     0x00000002
#define _ANSB_ANSB2_MASK                         0x00000004
#define _ANSB_ANSB2_LENGTH                       0x00000001

#define _ANSB_ANSB3_POSITION                     0x00000003
#define _ANSB_ANSB3_MASK                         0x00000008
#define _ANSB_ANSB3_LENGTH                       0x00000001

#define _ANSB_ANSB4_POSITION                     0x00000004
#define _ANSB_ANSB4_MASK                         0x00000010
#define _ANSB_ANSB4_LENGTH                       0x00000001

#define _ANSB_ANSB5_POSITION                     0x00000005
#define _ANSB_ANSB5_MASK                         0x00000020
#define _ANSB_ANSB5_LENGTH                       0x00000001

#define _ANSB_ANSB6_POSITION                     0x00000006
#define _ANSB_ANSB6_MASK                         0x00000040
#define _ANSB_ANSB6_LENGTH                       0x00000001

#define _ANSB_ANSB7_POSITION                     0x00000007
#define _ANSB_ANSB7_MASK                         0x00000080
#define _ANSB_ANSB7_LENGTH                       0x00000001

#define _ANSB_ANSB8_POSITION                     0x00000008
#define _ANSB_ANSB8_MASK                         0x00000100
#define _ANSB_ANSB8_LENGTH                       0x00000001

#define _ANSB_ANSB9_POSITION                     0x00000009
#define _ANSB_ANSB9_MASK                         0x00000200
#define _ANSB_ANSB9_LENGTH                       0x00000001

#define _ANSB_ANSB10_POSITION                    0x0000000A
#define _ANSB_ANSB10_MASK                        0x00000400
#define _ANSB_ANSB10_LENGTH                      0x00000001

#define _ANSB_ANSB11_POSITION                    0x0000000B
#define _ANSB_ANSB11_MASK                        0x00000800
#define _ANSB_ANSB11_LENGTH                      0x00000001

#define _ANSB_ANSB12_POSITION                    0x0000000C
#define _ANSB_ANSB12_MASK                        0x00001000
#define _ANSB_ANSB12_LENGTH                      0x00000001

#define _ANSB_ANSB13_POSITION                    0x0000000D
#define _ANSB_ANSB13_MASK                        0x00002000
#define _ANSB_ANSB13_LENGTH                      0x00000001

#define _ANSB_ANSB14_POSITION                    0x0000000E
#define _ANSB_ANSB14_MASK                        0x00004000
#define _ANSB_ANSB14_LENGTH                      0x00000001

#define _ANSB_ANSB15_POSITION                    0x0000000F
#define _ANSB_ANSB15_MASK                        0x00008000
#define _ANSB_ANSB15_LENGTH                      0x00000001

#define _ANSC_ANSC13_POSITION                    0x0000000D
#define _ANSC_ANSC13_MASK                        0x00002000
#define _ANSC_ANSC13_LENGTH                      0x00000001

#define _ANSC_ANSC14_POSITION                    0x0000000E
#define _ANSC_ANSC14_MASK                        0x00004000
#define _ANSC_ANSC14_LENGTH                      0x00000001

#define _ANSD_ANSD6_POSITION                     0x00000006
#define _ANSD_ANSD6_MASK                         0x00000040
#define _ANSD_ANSD6_LENGTH                       0x00000001

#define _ANSD_ANSD7_POSITION                     0x00000007
#define _ANSD_ANSD7_MASK                         0x00000080
#define _ANSD_ANSD7_LENGTH                       0x00000001

#define _ANSF_ANSF0_POSITION                     0x00000000
#define _ANSF_ANSF0_MASK                         0x00000001
#define _ANSF_ANSF0_LENGTH                       0x00000001

#define _ANSG_ANSG6_POSITION                     0x00000006
#define _ANSG_ANSG6_MASK                         0x00000040
#define _ANSG_ANSG6_LENGTH                       0x00000001

#define _ANSG_ANSG7_POSITION                     0x00000007
#define _ANSG_ANSG7_MASK                         0x00000080
#define _ANSG_ANSG7_LENGTH                       0x00000001

#define _ANSG_ANSG8_POSITION                     0x00000008
#define _ANSG_ANSG8_MASK                         0x00000100
#define _ANSG_ANSG8_LENGTH                       0x00000001

#define _ANSG_ANSG9_POSITION                     0x00000009
#define _ANSG_ANSG9_MASK                         0x00000200
#define _ANSG_ANSG9_LENGTH                       0x00000001

#define _ALCFGRPT_ARPT_POSITION                  0x00000000
#define _ALCFGRPT_ARPT_MASK                      0x000000FF
#define _ALCFGRPT_ARPT_LENGTH                    0x00000008

#define _ALCFGRPT_ALRMPTR_POSITION               0x00000008
#define _ALCFGRPT_ALRMPTR_MASK                   0x00000300
#define _ALCFGRPT_ALRMPTR_LENGTH                 0x00000002

#define _ALCFGRPT_AMASK_POSITION                 0x0000000A
#define _ALCFGRPT_AMASK_MASK                     0x00003C00
#define _ALCFGRPT_AMASK_LENGTH                   0x00000004

#define _ALCFGRPT_CHIME_POSITION                 0x0000000E
#define _ALCFGRPT_CHIME_MASK                     0x00004000
#define _ALCFGRPT_CHIME_LENGTH                   0x00000001

#define _ALCFGRPT_ALRMEN_POSITION                0x0000000F
#define _ALCFGRPT_ALRMEN_MASK                    0x00008000
#define _ALCFGRPT_ALRMEN_LENGTH                  0x00000001

